//邮箱
var emailRx = /^([a-zA-Z0-9_\.\-])+\@(([a-zA-Z0-9\-])+\.)+([a-zA-Z0-9]{2,4})+$/;
//手机号
var mphoneRx =/^[+]{0,1}(\d){1,3}[ ]?([-]?((\d)|[ ]){1,12})+$/;
//邮件
var postRx = /^[a-zA-Z0-9 ]{3,12}$/;
//6-16只能包含字符和数字
var pwd1Rx = /[0-9 | A-Z | a-z]{6,16}/;
//金钱的正则表达式
var moneyRx = /(^[1-9]([0-9]+)?(\.[0-9]{1,2})?$)|(^(0){1}$)|(^[0-9]\.[0-9]([0-9])?$)/;
//输入过程中的金钱的正则表达式
var inMoneyRx = /(^.([0-9]{1,2})?$)|(^[1-9]([0-9]+)?.$)|(^[1-9]([0-9]+)?(\.[0-9]{1,2})?$)|(^(0){1}$)|(^[0-9]\.[0-9]([0-9])?$)/;
//检查非空
var notNullRx = /^$/;
//检查昵称格式
var nickNameRx = /^[0-9a-zA-Z]*$/;//g


